package JavaRush.Level_4.Lecture_10___while;

/*
От 10 до 1

Вывести на экран числа от 10 до 1 включительно, используя цикл while.
Каждое значение с новой строки.
*/

public class Level_4_10___Task_2 {

    public static void main(String[] args) {
        //напишите тут ваш код

        int x = 10;
        while (x != 0){
            System.out.println(x);
            x--;
        }
    }
}
