package JavaRush.Level_4.Lecture_10___while;

/*
От 1 до 10

Вывести на экран числа от 1 до 10 включительно, используя цикл while.
Каждое значение с новой строки.
*/

public class Level_4_10___Task_1 {

    public static void main(String[] args) {
        //напишите тут ваш код

        int x = 1;
        while (x <= 10){
            System.out.println(x);
            x++;
        }
    }
}
