package JavaRush.Level_3;

/*
Меркантильные намерения

Вывести на экран десять раз надпись "Я хочу большую зарплату, и для этого изучаю Java"
*/

public class Level_3_12___Task_1 {
    public static void main(String[] args) {
        //напишите тут ваш код

        for (int i = 0; i < 10; i++) {
            System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        }

    }
}
